tap "1password/tap"
tap "gcenx/wine"
tap "heroku/brew"
tap "kegworks-app/kegworks"
tap "ngrok/ngrok"
tap "puma/puma"
tap "romkatv/powerlevel10k"
brew "ack"
brew "git"
brew "asdf"
brew "readline", link: true
brew "awscli"
brew "bat"
brew "boost"
brew "ctags"
brew "diff-so-fancy"
brew "dockutil"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffind"
brew "flyctl"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-delta"
brew "git-flow"
brew "gnupg"
brew "highlight"
brew "htop"
brew "hub"
brew "libzip"
brew "mkcert"
brew "most"
brew "node"
brew "neonctl"
brew "perl"
brew "pip-completion"
brew "powerlevel10k"
brew "prettyping"
brew "procs"
brew "pyenv"
brew "python@3.11"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "srt"
brew "ssh-copy-id"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "tree"
brew "vim"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "heroku/brew/heroku"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "caffeine"
cask "cleanmymac"
cask "discord"
cask "docker-desktop"
cask "dropzone"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "gemini"
cask "google-chrome"
cask "iterm2"
cask "ngrok"
cask "sketch"
cask "stats"
cask "tiles"
cask "visual-studio-code"
vscode "alefragnani.project-manager"
vscode "anasaraid.vscode-supabase-cli"
vscode "astro-build.astro-vscode"
vscode "austenc.tailwind-docs"
vscode "bceskavich.theme-dracula-at-night"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "codesandbox-io.codesandbox-projects"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "eseom.nunjucks-template"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "guapibai.nunjucks-prettier"
vscode "henriquebruno.github-repository-manager"
vscode "jabedhossain.web-preview"
vscode "jnbt.vscode-rufo"
vscode "jpoissonnier.vscode-styled-components"
vscode "kacperbiedka.one-candy-dark"
vscode "kakumei.ts-debug"
vscode "kamikillerto.vscode-colorize"
vscode "leeandher.unofficial-sentry-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-speech"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pkosta2005.heroku-command"
vscode "poorchop.theme-darktooth"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "samuherek.obcss"
vscode "shopify.ruby-lsp"
vscode "styled-components.vscode-styled-components"
vscode "supabase.vscode-supabase-extension"
vscode "ugross.vscode-react-snippets"
vscode "vincaslt.highlight-matching-tag"
vscode "vivek-kasture.properties-validator"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.gitconfig-lsp"
vscode "zignd.html-css-class-completion"
