tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
brew "asdf"
brew "awscli"
brew "bat"
brew "boost"
brew "commitizen"
brew "diff-so-fancy"
brew "dockutil"
brew "duf"
brew "dust"
brew "eza"
brew "fd"
brew "ffind"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "highlight"
brew "htop"
brew "jq"
brew "mkcert"
brew "most"
brew "perl"
brew "powerlevel10k"
brew "prettyping"
brew "procs"
brew "ripgrep"
brew "srt"
brew "thefuck"
brew "tldr"
brew "uv"
brew "vim"
brew "wget"
brew "zlib"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "caffeine"
cask "cleanmymac"
cask "discord"
cask "docker-desktop"
cask "dropzone"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-for-powerlevel10k"
cask "font-monaspace"
cask "gcloud-cli"
cask "gemini"
cask "google-chrome"
cask "iterm2"
cask "ngrok"
cask "sketch"
cask "stats"
cask "tiles"
cask "visual-studio-code"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "google.geminicodeassist"
vscode "openai.chatgpt"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "codesandbox-io.codesandbox-projects"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "googlecloudtools.cloudcode"
vscode "kacperbiedka.one-candy-dark"
vscode "kakumei.ts-debug"
vscode "kamikillerto.vscode-colorize"
vscode "leeandher.unofficial-sentry-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-speech"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-sqlite"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "pkosta2005.heroku-command"
vscode "poorchop.theme-darktooth"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "samuherek.obcss"
vscode "styled-components.vscode-styled-components"
vscode "supabase.vscode-supabase-extension"
vscode "vincaslt.highlight-matching-tag"
vscode "vivek-kasture.properties-validator"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.gitconfig-lsp"
vscode "zignd.html-css-class-completion"
